/* ************************************************************************** */
/*                                                                            */
/*                                                        :::      ::::::::   */
/*   ft_isalnum.c                                       :+:      :+:    :+:   */
/*                                                    +:+ +:+         +:+     */
/*   By: jleslee <jleslee@student.21-school.ru>     +#+  +:+       +#+        */
/*                                                +#+#+#+#+#+   +#+           */
/*   Created: 2021/10/10 09:48:49 by jleslee           #+#    #+#             */
/*   Updated: 2021/10/14 19:20:30 by jleslee          ###   ########.fr       */
/*                                                                            */
/* ************************************************************************** */

#include "libft.h"

// Возвращаем 1 если передано
// Число или буква, иначе
// Возвращаем 0

int ft_isalnum(int c)
{
	if (isdigit(c) || isalpha(c))
		return (1);
	return (0);
}