/* ************************************************************************** */
/*                                                                            */
/*                                                        :::      ::::::::   */
/*   ft_isprint.c                                       :+:      :+:    :+:   */
/*                                                    +:+ +:+         +:+     */
/*   By: jleslee <jleslee@student.21-school.ru>     +#+  +:+       +#+        */
/*                                                +#+#+#+#+#+   +#+           */
/*   Created: 2021/10/10 09:56:14 by jleslee           #+#    #+#             */
/*   Updated: 2021/10/14 19:23:18 by jleslee          ###   ########.fr       */
/*                                                                            */
/* ************************************************************************** */

#include "libft.h"

// Возвращаем 1 если передан
// Печатаемый символ,
// Иначе возвращаем 0

int ft_isprint(int c)
{
	if (c > 31 && c < 127)
		return(1);
	return (0);
}