/* ************************************************************************** */
/*                                                                            */
/*                                                        :::      ::::::::   */
/*   ft_isascii.c                                       :+:      :+:    :+:   */
/*                                                    +:+ +:+         +:+     */
/*   By: jleslee <jleslee@student.21-school.ru>     +#+  +:+       +#+        */
/*                                                +#+#+#+#+#+   +#+           */
/*   Created: 2021/10/10 09:52:27 by jleslee           #+#    #+#             */
/*   Updated: 2021/10/14 19:22:39 by jleslee          ###   ########.fr       */
/*                                                                            */
/* ************************************************************************** */

#include "libft.h"

// Возвращаем 1, если переданный
// Символ присутствует в ascii,
// Иначе возвращаем 0.

int ft_isascii(int c)
{
	if (c >= 0 && c <= 127)
		return (1);
	return(0);
}