/* ************************************************************************** */
/*                                                                            */
/*                                                        :::      ::::::::   */
/*   ft_strchr.c                                        :+:      :+:    :+:   */
/*                                                    +:+ +:+         +:+     */
/*   By: jleslee <jleslee@student.21-school.ru>     +#+  +:+       +#+        */
/*                                                +#+#+#+#+#+   +#+           */
/*   Created: 2021/10/11 19:16:56 by jleslee           #+#    #+#             */
/*   Updated: 2021/10/15 21:03:30 by jleslee          ###   ########.fr       */
/*                                                                            */
/* ************************************************************************** */

#include "libft.h"

// Поиск первого вхождения символа в строке,
// NULL если символ не найден

char *ft_strchr (const char *str, int ch)
{
	int i;

	i = 0;
	while(i < ft_strlen(*str))
		if(str[i] == ch)
			return ((char *)str[i]);
		i++;
	return (NULL);
}