/* ************************************************************************** */
/*                                                                            */
/*                                                        :::      ::::::::   */
/*   ft_tolower.c                                       :+:      :+:    :+:   */
/*                                                    +:+ +:+         +:+     */
/*   By: jleslee <jleslee@student.21-school.ru>     +#+  +:+       +#+        */
/*                                                +#+#+#+#+#+   +#+           */
/*   Created: 2021/10/11 19:10:02 by jleslee           #+#    #+#             */
/*   Updated: 2021/10/15 10:35:48 by jleslee          ###   ########.fr       */
/*                                                                            */
/* ************************************************************************** */

#include "libft.h"

// Перевод заглавного символа в строчный

int ft_tolower(int c)
{
	if (c > 64 && c < 91)
		return (c + 32);
	return (c);
}