/* ************************************************************************** */
/*                                                                            */
/*                                                        :::      ::::::::   */
/*   ft_toupper.c                                       :+:      :+:    :+:   */
/*                                                    +:+ +:+         +:+     */
/*   By: jleslee <jleslee@student.21-school.ru>     +#+  +:+       +#+        */
/*                                                +#+#+#+#+#+   +#+           */
/*   Created: 2021/10/11 19:03:45 by jleslee           #+#    #+#             */
/*   Updated: 2021/10/15 10:36:06 by jleslee          ###   ########.fr       */
/*                                                                            */
/* ************************************************************************** */

#include "libft.h"

// Перевод строчного символа в заглавный

int ft_toupper(int c)
{
	if (c > 96 && c < 123)
		return (c - 32);
	return (c);
}